{
    "posts": [{
            "id": "11",
            "title": "Best Ways to Build Leadership Skills",
            "slug": "Best-Ways-to-Build-Leadership-Skills",
            "subtitle": "Featured",
            "category": "Leadership skills",
            "date": "March 1, 2021",
            "author": "David Atilola",
            "description": "Having strong leadership skills is one of the major investments you can make in your career development. A good degree or technical skill can only take you so far, your leadership skill is what will keep you at the top. Regardless of where you are in your career pursuit, a time will come when you will be handed a leadership role, and your team will be depending solely on you. You might be aiming to lead an initiative, chosen to lead a team project, or even allowed to be part of a management, sometimes you can experience speed in your career, you might think it will take another two years before you are part of the decision-maker in your company, but it might just be happening in a few months.",
            "content": "Having strong leadership skills is one of the major investments you can make in your career development. A good degree or technical skill can only take you so far, your leadership skill is what will keep you at the top. Regardless of where you are in your career pursuit, a time will come when you will be handed a leadership role, and your team will be depending solely on you. You might be aiming to lead an initiative, chosen to lead a team project, or even allowed to be part of a management, sometimes you can experience speed in your career, you might think it will take another two years before you are part of the decision-maker in your company, but it might just be happening in a few months.<br/><br/> The best time to build your leadership skill is now. As a leader, you must be able to know your ability. The ability to ask yourself \"how you can find ways to empower and inspire your team\" is one of the most genuine examples of leadership skills out there. There are many ways to turn the conversation inward and focus on developing leadership skills.<br/><br/> <b>KNOW YOUR STRENGTH AND WEAKNESS</b></br> Developing leadership skills takes time and effort, and it begins with a thorough examination of your strengths and weaknesses. Have an honest self-examination. What is a leader going to accomplish if there is no roadmap for improving on your weakness? Are you an empathic leader, are you sensitive to the need of your team members, or you focus solely on you without considering if others are doing well or not? Do you work to bring out the best in other people? Or do you try to dominate others? Are you confident in your decision-making ability? Or are you plagued with self-doubt? When you know your strength and weakness, you know how to start addressing them. <br/><br/> <b>BE PASSIONATE</b><br/> Passionate leaders rise above any limitation. They always seem to find a way to get the job done, their focus is on the shared goal. They have a profound understanding of the people they are working with, they are very open-minded. They listen with the intent to understand, and not to advance their agenda, they have strong empathy. They care about the job, as much as they care about the team members. Passionate leaders have a clarity of vision, they know what they want, how they will get it, and they know where they are going and how they will get there. Passionate leaders understand the present demand, and their eyes are always on the future. They understand that failure is part of the process, and embrace challenges. Because they are fueled by positive energy, they surround themselves with like-minded people. Ultimately, a passionate leader is a risk-taker, executes ideas, and does not dwell on the past. They believe strongly in themselves, and seek to always learn from others. Show passion for everything you do, including your efforts at developing your leadership skills. <br/><br/><b>GOAL ORIENTED LEADERSHIP</b> <br/>Goal-oriented leadership involves setting clear and specific goals where it is known, based on established experience that they know how it can be achieved. Even the best leaders in the world don’t come out of anywhere. The grandest vision will never get off the ground if you don’t plot a path to get there. When building your leadership skill invest much time in solidifying your goal and lookout for ways to achieve them. A leader who is not goal-oriented will get nowhere. Once you achieve a goal you set another one. A goal-oriented leader is grounded in knowledge and a realistic outlook, being aware of the context in which the organization operates, such as the traditions on which it is based, and the risks being taken. <br/><br/> <b>FIND YOUR PURPOSE</b><br/>It is mostly said when the purpose of a thing is not known, its abuse is inevitable. If you don’t know your purpose then you set yourself up for a lifetime of wondering about, trying to lay hold on different things. Your purpose in life is your \"why\". When developing your leadership skill you must know why you are putting time and effort into your chosen goal. If you don’t know why, you will get tired, and give up eventually. What is your driving force? A larger paycheck from a job, the prestige that comes from a higher rank, promotion at work etc. Why do you want that larger paycheck? Is it so your family feels more secure? Perhaps you want to lead because you feel you can help others by developing products and services that they need, or you see a place where you can cause positive change in your industry. These are all higher purposes, and by identifying your own, you can better operate as a confident, knowledgeable, and empowering leader for others.",   
            "link": "post",
            "img": "img/photo/pexels-group.jpeg"
        },
        {
            "id": "1",
            "title": "Best Ways to Build Leadership Skills",
            "slug": "Best-Ways-to-Build-Leadership-Skills",
            "category": "Leadership skills",
            "date": "March 9, 2021",
            "author": "David Atilola",
            "description": "Having strong leadership skills is one of the major investments you can make in your career development. A good degree or technical skill can only take you so far, your leadership skill is what will keep you at the top. Regardless of where you are in your career pursuit, a time will come when you will be handed a leadership role, and your team will be depending solely on you. You might be aiming to lead an initiative, chosen to lead a team project, or even allowed to be part of a management, sometimes you can experience speed in your career, you might think it will take another two years before you are part of the decision-maker in your company, but it might just be happening in a few months.",
            "content": "Having strong leadership skills is one of the major investments you can make in your career development. A good degree or technical skill can only take you so far, your leadership skill is what will keep you at the top. Regardless of where you are in your career pursuit, a time will come when you will be handed a leadership role, and your team will be depending solely on you. You might be aiming to lead an initiative, chosen to lead a team project, or even allowed to be part of a management, sometimes you can experience speed in your career, you might think it will take another two years before you are part of the decision-maker in your company, but it might just be happening in a few months.<br/><br/> The best time to build your leadership skill is now. As a leader, you must be able to know your ability. The ability to ask yourself \"how you can find ways to empower and inspire your team\" is one of the most genuine examples of leadership skills out there. There are many ways to turn the conversation inward and focus on developing leadership skills.<br/><br/> <b>KNOW YOUR STRENGTH AND WEAKNESS</b></br> Developing leadership skills takes time and effort, and it begins with a thorough examination of your strengths and weaknesses. Have an honest self-examination. What is a leader going to accomplish if there is no roadmap for improving on your weakness? Are you an empathic leader, are you sensitive to the need of your team members, or you focus solely on you without considering if others are doing well or not? Do you work to bring out the best in other people? Or do you try to dominate others? Are you confident in your decision-making ability? Or are you plagued with self-doubt? When you know your strength and weakness, you know how to start addressing them. <br/><br/> <b>BE PASSIONATE</b><br/> Passionate leaders rise above any limitation. They always seem to find a way to get the job done, their focus is on the shared goal. They have a profound understanding of the people they are working with, they are very open-minded. They listen with the intent to understand, and not to advance their agenda, they have strong empathy. They care about the job, as much as they care about the team members. Passionate leaders have a clarity of vision, they know what they want, how they will get it, and they know where they are going and how they will get there. Passionate leaders understand the present demand, and their eyes are always on the future. They understand that failure is part of the process, and embrace challenges. Because they are fueled by positive energy, they surround themselves with like-minded people. Ultimately, a passionate leader is a risk-taker, executes ideas, and does not dwell on the past. They believe strongly in themselves, and seek to always learn from others. Show passion for everything you do, including your efforts at developing your leadership skills. <br/><br/><b>GOAL ORIENTED LEADERSHIP</b> <br/>Goal-oriented leadership involves setting clear and specific goals where it is known, based on established experience that they know how it can be achieved. Even the best leaders in the world don’t come out of anywhere. The grandest vision will never get off the ground if you don’t plot a path to get there. When building your leadership skill invest much time in solidifying your goal and lookout for ways to achieve them. A leader who is not goal-oriented will get nowhere. Once you achieve a goal you set another one. A goal-oriented leader is grounded in knowledge and a realistic outlook, being aware of the context in which the organization operates, such as the traditions on which it is based, and the risks being taken. <br/><br/> <b>FIND YOUR PURPOSE</b><br/>It is mostly said when the purpose of a thing is not known, its abuse is inevitable. If you don’t know your purpose then you set yourself up for a lifetime of wondering about, trying to lay hold on different things. Your purpose in life is your \"why\". When developing your leadership skill you must know why you are putting time and effort into your chosen goal. If you don’t know why, you will get tired, and give up eventually. What is your driving force? A larger paycheck from a job, the prestige that comes from a higher rank, promotion at work etc. Why do you want that larger paycheck? Is it so your family feels more secure? Perhaps you want to lead because you feel you can help others by developing products and services that they need, or you see a place where you can cause positive change in your industry. These are all higher purposes, and by identifying your own, you can better operate as a confident, knowledgeable, and empowering leader for others.",   
            "link": "post",
            "img": "img/photo/pexels-group.jpeg"
        },
        {
            "id": "2",
            "title": "5 Ways to become a Writer",
            "slug": "5-Ways-to-become-a-Writer",
            "category": "Become a Writer",
            "date": "March 14, 2021",
            "author": "David Atilola",
            "description": "Writing is a craft. A lot of people, early in life, desire to become a writer, a novelist, poet, artist etc. But like all craft, writing is not as easy as it appears. It takes creativity and imagination to become a writer. As a writer, you tend to spend hours in front of your screen, thinking about what to write, how or where to start. Some even complain about writer's block, a writer’s block is a condition in which an author is unable to produce new work, it is a creative slowdown. If you have been wanting to launch your writing creativity, or you love writing but you constantly face challenges and don’t know where to start, this piece is right for you.",
            "content": "Writing is a craft. A lot of people, early in life, desire to become a writer, a novelist, poet, artist etc. But like all craft, writing is not as easy as it appears. It takes creativity and imagination to become a writer. As a writer, you tend to spend hours in front of your screen, thinking about what to write, how or where to start. Some even complain about writer's block, a writer’s block is a condition in which an author is unable to produce new work, it is a creative slowdown. If you have been wanting to launch your writing creativity, or you love writing but you constantly face challenges and don’t know where to start, this piece is right for you.<br/><br/> There are several factors that could make a newbie writer find it difficult to come up with an idea, or make one feel an inability to write. Lack of fascinating ideas is a major problem new writers encounter, you struggle with an idea of what to write about specifically, you spend hours thinking and you just don’t know what to put down. Perhaps you are struggling with confidence, you are not proud of the little work you have been able to come up with, and you are thinking who would want to read this nonsense. Your work is unique and it is nothing to be ashamed or discouraged about. This lack of confidence has made many hide their writings, they do not have the courage to publish it to the public. This is just a fear that most writers face early in life,  but a time will come where you have to overcome that fear or lack of confidence. Every piece of writing is important, so is your work. It can even be the fear of criticism that stopped you from becoming a writer, we all go through that phase, but you have to overcome this fear. At one point in your writing career you will be criticized, but you must develop the ability to see all criticism as a way to improve on your craft. It is a feedback you must accept with all positivity. <br/><br/> Writing is a noble art. It is a craft that comes with much prestige. There are great works by several writers which has impacted humanity from different generations to another, people like Machiavelli, Plato, Hemingway, Virginia Woolf. Though these people have died, but their work still impacts us even today, so writing is an endeavour that gives you the opportunity to touch people’s life and make the world better. As a budding writer, do you know your little writing can make a difference in the lives of those around you. Never underestimate the power in your pen. The popular sayings goes: “the pen is mightier than the sword.” This is why dictators suppress the voice of people who write against them, because the pen is mighty.<br/><br/>As a growing writer, the following tips can be of help to you in putting down your creative ideas: <br/><br/> <b>START WITH WHAT MATTER</b><br/>It is always good to start with subjects that matter to you. We all have different things that we are passionate about, some are passionate about education, some nature, animal rights, arts, beauty, etc. Find out what excites you and write about such subject. This way it will be much easier for you to start. If you are struggling to start, have a dialectical conversation with yourself, ask yourself questions about things that makes you curious. There certain issues that will give you curiosity, such issues are worth writing about. What matters to you most? is it human right, justice, peace, entertainment, or reading. For example, if you love reading books, you can do a review of the book you are currently reading, your major takeaway from the book is enough. Perhaps you like food, you can start writing about such subject. You will ask, who want to read about food, trust me, you will never know until you start, what I guarantee you is that you are not the only one who is curious about such subject. What matters to you also matter to some other people, therefore there is always someone out there who will read and appreciate your writing.<br/><br/><b>FIND A NICHE</b><br/>Finding a niche is another extremely important step, in becoming a writer. A niche is a segment of a larger audience, it is a group of people with specific interest. It is a subset of a larger market. A niche give you the opportunity to directly reach specific people who are curious about the subject you are writing on. When you focus on a particular niche it will be much easier for you to understand the need of your audience, and understand their problems easily, that way you can solve their problems.<br/><br/><b>HAVE A WRITING PLAN</b><br/>One thing that is essential, is having a writing plan. Imagine you have intentions to write about a topic, you shouldn’t just jump on the topic and start writing. When you get stuck you won’t know how to continue, you might even lose the motivation to keep going. Before setting out to start your write up, break down the topic into sections, it is not just about introduction, body, and conclusion, rather,  it is about everything you want to write about on that topic. Break it down into bits, let it have a theme and good flow. By doing this you will be able to get into the mood of finishing up by all means, because you have all you need to write. You won’t have to think for long. Always break down the writing process, do not underestimate this tip, it is highly significant. It will also help you to understand what matters and what does not,  it will facilitate research, and help you source for necessary resources you need for that particular writing.<br/><br/><b>DON’T BE SCARED OF MAKING A MESS</b><br/> One thing that restrict people from getting to the full extent of their creativity is the fear of making a mess. Don’t allow that fear to hold you down. Make a mess and you will learn from it. Perfection is a process and the more you put in the work, the more you get better. The more the mess, the more you grow, the merrier the better. You might have heard \"it is a mess to you, but a message to your reader, why deprive your readers of that message\". So do not be scared of making a mess. Also, when you face your computer screen to write, do as many \"freewrites\" as you can, and throw as much material into the bin if you like, it is better to write rubbish and rewrite again, throw as much draft into the recycle bin, eventually you will come up with the real thing. Free your mind up to be as creative as you can.<br/><br/><b>WRITE EVERYDAY</b><br/>The best way to get better at something is to be consistent. The best way to be a writer is to write, no other way to it. If you read hundred blogs on writing, you will still have to write. No great writer become great without writing, your ability to write everyday will facilitate your improvement. You want to be a writer, write everyday for the next three months and see the progress that will result from it. One way to do this is to find accountability groups, find someone you can be accountable to, you can join a writing group if you can find one. The most talented of writers had to write consistently for years before they attained that height. If you do something everyday, you become a master of it. If you can develop this habit of writing everyday it will not only erase the fear you have, it will also help you develop your unique style. Keep writing.",
            "link": "post",
            "img": "img/photo/writer.jpg"
        },
        {
            "id": "3",
            "title": "5 Benefits of eLearning",
            "slug": "5-Benefits-of-eLearning",
            "category": " Benefits of eLearning",
            "date": "March 16, 2021",
            "author": "David Atilola",
            "description":  "No doubt, eLearning has transformed our mode of learning today. Students can acquire knowledge from the comfort of their homes, but elearning is not merely about getting education from a comfort zone, it is much more about using innovative technology to make learning simpler, easier, and more effective for people. This mode of learning has moved past the debating stage of whether it has come to stay or not. We can all attest to the fact that it is the only alternative learning we have at our disposal. In a world that is struck by an unusual pandemic, different sectors around the world, including the schools were shutdown, but education has moved on with elearning not being limited by the four walls of classrooms. Today, you can learn anything online for free as thousands of educational contents are being produced every day. In this article, we will look at five benefits of elearning:",
            "content": "No doubt, eLearning has transformed our mode of learning today. Students can acquire knowledge from the comfort of their homes, but elearning is not merely about getting education from a comfort zone, it is much more about using innovative technology to make learning simpler, easier, and more effective for people. This mode of learning has moved past the debating stage of whether it has come to stay or not. We can all attest to the fact that it is the only alternative learning we have at our disposal. In a world that is struck by an unusual pandemic, different sectors around the world, including the schools were shutdown, but education has moved on with elearning not being limited by the four walls of classrooms. Today, you can learn anything online for free as thousands of educational contents are being produced every day. In this article, we will look at five benefits of elearning:<br/><br/><b>GIVES A SENSE OF COMMUNITY</b><br/>Online learning like traditional learning creates a sense of community. This sense of community can be very diverse, because unlimited number of people are learning the same thing you are learning. For instance, it is a bit easier to network with your fellow classmates. A friend took a course on coursera, at the end of the course she was paired with a group to carry out an assignment, the other members of this group were from different continents, and they were not more than ten. In a group such as this, you have the opportunity to get views from different people with their own sociocultural backgrounds. This kind of community is not possible in the traditional white board and marker classrooms. The community online is diverse and of great quality. <br/><br/><b>MORE PRODUCTIVE </b><br/>Compared with the traditional mode of learning, students are more productive with online learning. You don't have to spend time driving to campus or having to rush chores just so you can meet up with the next lecture. Instead you can use your time judiciously. Most students have been advised to always go over what they learnt in class that same day. With elearning you have the opportunity to read more about the topic you just took, the productivity is very high. Learning and schooling are a state of mind and not a place.<br/><br/><b>SAVES TIME</b><br/>Online learning provides an opportunity to access content from anywhere and anytime. This is the best form of learning, it is not time consuming, because you have the opportunity to learn at your own pace, if you are getting a lecture via audio, text, or video, you can always go back to grasp and understand a subject. There is no room for unrelated discussions that can derail class sessions. Learning online is not necessarily time or place-bound, learners do not have to sit in one place to complete a course. It is easy to learn a new subject without wasting your time, or getting worried if you will get things at your own pace, because this type of learning gives room to everyone to learn at their own pace.<br/><br/><b>SAVES COST</b><br/>In the traditional setting, students are required to print materials, travel to classrooms, and several other factors that require spending an amount of money, but with online learning,  students do not need to buy any training material neither is there a need to travel anywhere, hence saves you a lot of money. Online learning is not as expensive as the traditional mode of schooling. You can get access to free content from various online resources. <br/><br/><b>HIGHLY FLEXIBLE</b><br/>Online learning is very flexible for both the teacher and student, unlike the traditional mode which is very strict and rigid. It is an innovative and adaptive mode of learning. It enables the student to take trainings from anywhere without any inconvenience. This enables the student to go over the lecture at regular intervals. It is very flexible for the teachers as they are not required to go from one classroom to the other, they can schedule classes from their offices and make it as effective as possible.",
            "link": "post",
            "img": "img/photo/pexels-watching a cam.jpg"
        },
        {
            "id": "4",
            "title": "4 Steps to Prepare Yourself to Learn How to Code.",
            "slug": "4-Steps-to-Prepare-Yourself-to-Learn-How-to-Code",
            "category": "Learn How to Code",
            "date": "March 18, 2021",
            "author": "Imelda Adjei",
            "description": "Coding is said to be an easy task that everyone in the modern 21st century should be able to do. It has become a core aspect of our lives and is intertwined in every part of our lives.",
            "content": "Coding is said to be an easy task that everyone in the modern 21st century should be able to do. It has become a core aspect of our lives and is intertwined in every part of our lives. But that is not necessarily true. Yes, coding may be simple but it takes a lot of self-motivation to push forward and be consistent in learning.<br/><br/><b>BE MOTIVATED</b><br/>You must be self-motivated to learn a coding language and must be willing to expand your knowledge through courses and hackathons to keep your skills sharp.<br/><br/><b>IMPROVE YOUR LOGICAL THINKING</b><br/>Learning how to code does not just entail writing the code. A computer is like an empty mind, a clean slate. What you feed it is what you would receive. (Garbage in Garbage Out). You would need to find a logical and smart way of ensuring that a task is done correctly and efficiently. In order to learn coding properly, you must sharpen your way of thinking. You must learn to think more logically and practically. This would help you understand the basics of coding and help you write concise and efficient code.<br/><br/><b>WORK WITH OTHERS</b><br/>Teamwork is an essential part of learning to code. Working with others exposes you to many different views on coding and provides you with the opportunity to experience the different ways in which a task could be accomplished. This is why many coding websites have discussion boards. It is the best way to learn and interact with others and can serve as a great motivator. <br/><br/><b>PRACTICE! PRACTICE! PRACTICE!</b><br/>The best way to learn how to code is through practice. Practicing makes you bring theoretical concepts to life. As you see your code run, you get used to using certain concepts and do not have to memorize them as they come naturally. Practicing also helps your skills grow. You will learn new ways of compressing your code and find shortcuts to increase the efficiency of your code.",
            "link": "post",
            "img": "img/photo/pexels-woman on glasses.jpg"
        },
        {
            "id": "5",
            "title": "5 Ways to build a professional network",
            "slug": "5-Ways-to-build-a-professional-network",
            "category": "Ways to build a professional network",
            "date": "March 20, 2021",
            "author": "David Atilola",
            "description": "Professional networking is one of the most significant things you will do to advance your career. It helps you stay connected with key players in your industry. It can be very tricky when you are just starting, or when you are about to have a career change and you don’t know anyone in your new line of career. These are some of the things we will be delving into in this article. Whether you are a young professional who is just starting, or you are about to have a career change, this article will answer some of the questions you have about building your ",
            "content": "Professional networking is one of the most significant things you will do to advance your career. It helps you stay connected with key players in your industry. It can be very tricky when you are just starting, or when you are about to have a career change and you don’t know anyone in your new line of career. These are some of the things we will be delving into in this article. Whether you are a young professional who is just starting, or you are about to have a career change, this article will answer some of the questions you have about building your professional network. It is often said that your network is your network. This statement is very true because the size of your network most of the time will determine how valuable you are. Here are five ways that will work if you are looking at building your professional network: <br/><br/><b>OFFER HELP TO PEOPLE</b><br/>Professional networking is one of the most significant things you will do to advance your career. It helps you stay connected with key players in your industry. It can be very tricky when you are just starting, or when you are about to have a career change and you don’t know anyone in your new line of career. These are some of the things we will be delving into in this article. Whether you are a young professional who is just starting, or you are about to have a career change, this article will answer some of the questions you have about building your professional network. It is often said that your network is your network. This statement is very true because the size of your network most of the time will determine how valuable you are. Here are five ways that will work if you are looking at building your professional network:<br/><br/><b>MAKE IT A HABIT</b><br/>It all comes down to forming the habit of connecting with other professionals. You must be intentional about this. You need to understand that a lot of people want to advance in their career and normally people might not set out to connect with you, but you must be intentional about it. At least set out to connect with one person every working day. If you go to an event, introduce yourself and what you do. If you are attending a webinar, don’t miss any opportunity to connect with a professional. <br/><br/><b>BE A VOLUNTEER</b><br/>One of the best ways to build your professional network is to volunteer with a nonprofit or even profitable organization. Most times, people who volunteer for a particular cause are passionate about that thing, therefore volunteering means you have a high chance of meeting other people who are passionate about a particular thing you are committed to. Volunteering leads to you making substantial conversation with people who are willing to give their time to a charity or any other voluntary work. Also, it provides a platform to build a relationship with people from different backgrounds, which will give a big boost to your network.<br/><br/><b>JOIN A SOCIAL GROUP</b><br/>Do not underrate the power of small or big social groups. Most social groups or clubs are committed to seeing their members succeeding in their chosen fields because it is those members who will later provide funding for the group, therefore members of this group always want to help one another. This is one of the best ways to build your professional network, social groups are an asset if you find one to join. These groups typically serve as a function to further the success of their particular field and are usually made up of people with years of experience, knowledge, and connections. Joining this group allows you to build connections, it also makes room to further your knowledge in your profession. <br/><br/><b>ALWAYS FOLLOW UP</b><br/>Arguably the most important part of building your professional network is following up after the first contact. What does this mean, it means you are making room for a meaningful relationship, and not just a one-time benefit. A relationship is a valuable social equity, never joke with it. After your initial meeting, call them up a day or two later and follow up on the chat you had or connect with them on LinkedIn and send them a message. Building your professional network is not easy, but it can be the most rewarding thing you will do for your career.",
            "link": "post",
            "img": "img/photo/for-students.jpeg"
        },
        {
            "id": "6",
            "title": "7 Leadership Skills That Will Make You a Better Entrepreneur",
            "slug": "7-Skills-That-Will-Make-You-a-Better-Entrepreneur",
            "category": "Skills That Will Make You a Better Entrepreneur",
            "date": "March 22, 2021",
            "author": "David Atilola",
            "description": "Entrepreneurs need to possess certain leadership skills, in other to deliver better output for the company. Leadership skills will make the difference between an average entrepreneur and a successful one. It is a required virtue for leaders to treat their subordinates with dignity, without subjecting them to dictatorial ideologies. Being an entrepreneur makes you automatically a leader because you have people who report to you directly or indirectly. You must find a way to embrace doing right by your employees because you understand the ",
            "content": "Entrepreneurs need to possess certain leadership skills, in other to deliver better output for the company. Leadership skills will make the difference between an average entrepreneur and a successful one. It is a required virtue for leaders to treat their subordinates with dignity, without subjecting them to dictatorial ideologies. Being an entrepreneur makes you automatically a leader because you have people who report to you directly or indirectly. You must find a way to embrace doing right by your employees because you understand the overall success of the organization has much to do with gratified and motivated people. Becoming a good leader is not so hard nut to crack, but it is very demanding as it requires every fiber you have in you. It cannot be overemphasized, the need for proper leadership skills for you to stand out as a great entrepreneur. A true leader is a good influencer of people and must possess these qualities. Leadership is not about being the CEO, manager, president, it is not about the title. It is about having the right qualities that make others want to follow you. Leaders help themselves and others to do the right things.<br/><br/><b>EFFECTIVE COMMUNICATION</b><br/>Effective communication is a non-negotiable requirement for every enterprise to taste success at an accelerated pace. A business enterprise can suffer if leaders lack good communication attributes. Effective communication overwhelmingly payback a business in lucrative ways impacting both internal and external associations. Good communication builds a strong bond and comprehension within a business and its employees and sets clear expectations. It is very important to establish a strong bond between business owners and employees. Frequent communication between both entities reaps favorable outcomes by creating a sense of belongingness. Social gatherings and other interactive sessions with staff members boost their morale, build team unity, eliminate negativity and promote loyalty amongst employees. Entrepreneurial success will not be possible if there is no healthy and reliable interaction between employees, clients, and other stakeholders. <br/><br/><b>ABILITY TO DELEGATE</b><br/>One of the major difficulties leaders go through is the transition from doing work to leading people. As a new leader, you will get away with a lot of things, you will get away with holding on to work, but as time goes and much work falls on your table, you will be exposed and most likely required to delegate a task to the right person.  To raise the ceiling of your leadership potential, you need to extend your presence through the actions of others, engaging people so that they contribute their best work to your shared priorities. To set the table for effective delegation, make sure you express why something is important to you, confirm that your expectations for the work have been communicated, ask how much of your involvement they need, and practice saying no.<br/><br/><b>STRATEGIC VISION</b><br/>You need a strategy to succeed in business. You need to have a clear path of where you want to be in the next five years. Plan where you will be in the next few years and how you will get there. Successful entrepreneurs, no doubt, create a vision of the future which inspires others to get involved in the company. There is a need for a blueprint. It is not enough to start a business and make money, an architectural blueprint is critical. <br/><br/>Richard Siegelman, a general partner at Kleiner Perkins, probes to find out how people got together and what motivates them as a group. He asks, “Is there a shared vision and culture?”. According to Siegelman, “Some people may have strong technical dreams, and others may be completely different-a warning signal.” Learn how you can focus on, and achieve long-term entrepreneurial success. Success depends on the ability to think strategically and achieve results quickly.<br/><br/>Howard Schultz, founder and CEO of Starbucks Coffee, says, “Vision is what they call it when others can’t see what you see.”<br/><br/><b>SEEK ADVICE</b><br/>Asking for advice is not a sign of weakness. It pays to seek out impartial professional advice. We can all pretend we know everything about the industry, but deep down within we know the truth, innovation keeps evolving, and anybody can be left behind. According to a study involving 1,500 participants at the Harvard Business School, looking to consult with colleagues should be a priority in business, as taking the right piece of advice might be the difference between success and failure.<br/><br/><b>GOOD DECISION MAKING</b><br/>As a leader, you will make decisions from time to time. The company will fall if all you do is decide to please other people. You must decide for the greater good of the company. We should stick to our guns and make decisions that are best for organizations while taking care of our people, we’re going to be just fine. As an entrepreneur, learning how to make decisions quickly and confidently will serve you well.<br/><br/><b>TRUSTWORTHINESS</b><br/>As a leader, you must be trustworthy and accountable. Not only you, but you must also instill this attitude at the core of your organization. The first ingredient of being trustworthy is taking a look at your behavior before judging others, in other words, know yourself. Self-awareness is a primary quality to being viewed as trustworthy. When a leader is willing to look inwardly, they become vulnerable and uncover qualities that may impact his or her ability to lead. By looking inwardly a leader is more effective at leading outwardly.<br/><br/><b>ABILITY TO PERSUADE OTHERS</b><br/>Persuasion is one of the most important skills for entrepreneurs. You have to persuade others to believe in your vision. This is a function of communication, it should not be neglected. When you’re able to persuade those around you, you’re able to change their minds, to get them to see your point of view. The best way to persuade people is to find the things they value, then you provide that value to them over and over again. Persuasive people are influential. They’re respected, well-liked, and able to talk about their accomplishments, goals, and ideas in a way that gets those around them excited and passionate as well.",
            "link": "post",
            "img": "img/photo/pexels-woman-on-cam.jpg"
        },
        {
            "id": "7",
            "title": "Stock Selection Investment Methodology",
            "slug": "Stock-Selection-Investment-Methodology",
            "category": "Stock Selection Investment Methodology",
            "date": "April 20, 2021",
            "author": "Amar Mehta",
            "description": "Nearly two decades ago, when I was actively engaged in equity portfolio management (including long-short, catalyst/event-driven, and market neutral strategies) I had put together a simple training seminar for junior analysts and associates and had compiled a handbook, of sorts. ",
            "content": "A simple handbook<br/><br/> Nearly two decades ago, when I was actively engaged in equity portfolio management (including long-short, catalyst/event-driven, and market neutral strategies) I had put together a simple training seminar for junior analysts and associates and had compiled a handbook, of sorts. In subsequent years, this handbook got passed around and was informally utilized by other institutions. Below is the one-page outline of this handbook that touches upon the main points. The book was published more than a decade later on Amazon: S.S.I.M.-ple Handbook: Stock Selection Investment Methodology. Its free for Kindle unlimited members.<br/><br/>The concept and approach remain relevant to this day. Given the recent heightened interest and volatility surrounding the equity markets, I thought it may assist or augment the investment process for some readers. Good luck! <br/><br/>Stock Selection & Investment Methodology.<br/><br/> <b>Step 1: The Basics of Potential Investment (PI)</b><br/><b>I.</b> Understand the Industry Dynamics, Size, Growth of Potential Investment<br/>a. What is size of market, growth potential, historic growth <br/> b. What are the industry drivers<br/>c. Factors that need monitoring or understanding present/potential factors affecting industry dynamics<br/>d. Competition and what changes can affect that:<br/>i. New entrants vs. change in technology or regulation<br/>e. How is PI positioned within industry<br/><b>II.</b> Business Model of PI<br/>a. Earnings drivers and Expense drivers / Margin analysis<br/>b. Build Model using historic data, industry drivers, management strategy, and project “LIKELY” outcome (see chart)<br/>i. Includes detailed understanding of financials<br/>ii. Meeting with management<br/>iii. Perform sensitivity analysis for other possibilities<br/><b>III.</b> Determine Target Valuation<br/>i. Comparables on various industry specific metrics<br/>ii. DCF (if applicable), DDM, etc..<br/>iii. Sum-of-the-parts<br/><br/><b>Step 2: Determining Timing & Size of PI</b><<br/>b>I.</b> Price Movement <br/>a. Analyzing Discrete Historic Price Movements (accounting for market based activity vs. company specific)<br/><b>II.</b> Catalysts<br/>a. Understanding and Recognizing Historical and Potential Catalysts<br/>b. Using Regression Analysis or other Historical Applied Methodologies to Determine future potential “LIKELY” outcomes based on catalysts<br/><b>III.</b> Technical Analysis Overlay<br/>a. Using Technical Analysis to add further support or credence to outcomes<br/>i. Head/shoulders, Double-top/bottom, Breakout-volume based, Oscillators, Bollinger Bands, etc.<br/><br/><b>Step 3: Understanding Market Environment (SENTIMENT)</b><br/><b>I.</b> Mosaic Approach<br/>a. Taking into account Step 1 & 2, one should generally be able to infer overall market sentiment regarding industry and stock<br/><b>II.</b> Who is the Axe?<br/>a. Sell-side and buy-side on the stock<br/>i. Understanding what factors are relevant to the Axe<br/>1. note if step 1 & 2 are done to perfection then look in mirror!<br/><b>III.</b> Shareholders <br/>a. Know the main shareholders their strategy and reasons for investment<br/>b. Sell your idea to new and existing shareholders if different and/or unique<br/> <br/>",
            "link": "post",
            "img": "img/photo/finance-woman.jpg"
        },
        {
            "id": "8",
            "title": "4 Ways Technology Will Impact the Future of Work",
            "slug": "Ways-Technology-Will-Impact-the-Future-of-Work",
            "category": "Ways Technology Will Impact the Future of Work",
            "date": "April 23, 2021",
            "author": "David Atilola",
            "description": "There is a major change currently going on in the world of work. This change is causing significant panic, anxiety, and uncertainty for many people. Technology is transforming how we work, beyond all recognition, creating groundbreaking opportunities. ",
            "content": "There is a major change currently going on in the world of work. This change is causing significant panic, anxiety, and uncertainty for many people. Technology is transforming how we work, beyond all recognition, creating groundbreaking opportunities. Beyond the current social climate companies will need to ask a major question, where they want to fit in, in this current reality. More rigid companies might suffer going forward, successful companies will be determined by their flexibility and adaptability. If we want to do things only the way it has been done before, then we might experience great struggle. The future is for those who are willing to change and adapt.<br/><br/>There is a major shift that is quite visible to everyone in the workforce. The pandemic made several companies more flexible, while most employees were working from home. The pandemic also made some companies shut down their operation, as a result of the inability to keep up. For more than a year, people have been working from home, no stepping into the office, but as companies begin to open up their physical office more people will choose to work from home, and any company not willing to adapt with a plan might lose valuable employees.<br/><br/>The latest research from the International Labour Organization and the World Economic Forum shows that up to 70 percent of our current jobs could be replaced by robotic process automation in the next 10 years. For humans to compete with robots and artificial intelligence in the future, we need to develop our human intelligence at the same pace as we develop artificial intelligence.<br/><br/>Technology is by nature forward-looking, and designing technology requires us to imagine a new user experience, for which we are developing a mechanism to do something different than today. To do so, we need to develop our creative thinking and imagination, for our current thinking will not help us solve the problems the same thinking created, as Einstein famously quoted.<br/><br/>Here are four ways technology will impact the future of work:<br/><br/><b>INNOVATIVE WORK CULTURE </b><br/>As Steve Jobs famously said, innovation distinguishes between a leader and a follower. Innovative company culture will be a major highlight in the future with companies having all their meetings online, daily standups on zoom, Google Meet, and several others. Companies have to form new working culture. The other day, the CEO of a major tech company was given a surprised birthday celebration on the company’s app. A few years ago, we were only debating about these things, but now the reality is visible for us. During the pandemic, many leaders spoke more often and openly with staff than they ever had before. That transparency created an employee experience that got people through crisis and provided the basis for the kind of regular communication linked to strong employee engagement. As we think about the future of work, innovative culture is going to be at the center.<br/><br/><b>REMOTE WORK</b><br/>Before now, remote working has always been a subject of major debate, whether companies will allow employees to fully work from home. But one of the major lessons from the pandemic has been that organizations have finally realized that the physical presence of employees in the premises of the employer has no direct link to their productivity. The world truly has become a global village, where countries and cities are now competing for the best talents. <br/><br/><b>EMPLOYEE TRAINING </b><br/>Companies will need to optimize the performance and well-being of their employees. Employees stuck at home want to learn new skills, stay ahead, and adopt new practices such as mindfulness and resilience training to help cope with the abrupt change in work-life balance. As a company in these contemporary and changing times, there is a major need for training of employees. Also, employees must take a deliberate effort to see to their training and development. There is always going to be a need for constant training in this fast-paced technology environment.<br/><br/><b>EQUAL OPPORTUNITIES FOR ALL</b><br/>It is such an amazing time, with groundbreaking inventions and innovation, without restrictions or limits. People can have access to the world, it does not matter where you are in the world. Whether you have from a high-income or low-income country, you have an equal opportunity that is being powered by technology. It does not have to do with your gender, color, or social class. We all have equal opportunities with technology. It is an advantage some generations never had, and we are going to be seeing more of this in the future.",
            "link": "post",
            "img": "img/photo/Tech2.jpeg"
        }
    ]
}