{
    "blocks": [
        {
            "name": "JOB MARKET",
            "img": "/content/img/photo/career.jpeg",
            "slug": "Job-market",
            "subname": "To get the latest updates and news on career, jobs, workforce development, and education <a href='https://www.workschool.co/newsletter/'><u>subscribe to this newsletter by going here.</u></a>",
            "text": "“The only way to do great work is to love what you do. If you haven't found it yet, keep looking. Don't settle.” – Steve Jobs.",
            "content": "<br/><br/><i>Quote of the Week<br/><br/>“The only way to do great work is to love what you do. If you haven't found it yet, keep looking. Don't settle.” – Steve Jobs.</i><br/><br/><br/><b>Published on July 13, 2021</b><hr/><a href='https://www.linkedin.com/in/glen-patterson'><u>Glen Patterson</u></a><br/><br/><b>An educator, speaker, consultant, founder, investor, and squash and soccer enthusiast. Glen is the co-founder of the <a href='https://www.workschool.co/'><u>WorkSchool.</u></a></b><hr/><br/><b>There was a tremendous shift in the 2020 job market due to the pandemic.</b><br/><br/> While some companies used to offer the ability to work from home as a perk, it has now become the norm for most businesses. By 2025, an estimated <u><a href='https://www.vox.com/recode/2019/10/9/20885699/remote-work-from-anywhere-change-coworking-office-real-estate'>70% of the workforce will be working remotely</a></u> at least five days a month.<br/><br/>The year 2020 surely changed how people work, 2021 made us realized there is no going back when it comes to working from home. Some people have decided to forego their job, as a result of companies telling their employees to come back to the office, more innovative and adaptive companies quickly pick up this talent.<br/><br/>This trend is going to continue in the future, companies who are not willing to adapt to the new style of working remotely risk losing their best talent. Employees should not be forced to come back to the office, there should be an option for those who would like to go back to the physical office space and those who will remain remote. <br/><br/><b>According <a href='https://www.reuters.com/article/us-health-coronavirus-technology/permanently-remote-workers-seen-doubling-in-2021-due-to-pandemic-productivity-survey-idUSKBN2772P0'><u>to a survey from Enterprise Technology Research</u></a> (ETR).</b> “The productivity metric is proving that remote work is working,” said Erik Bradley, chief engagement strategist at ETR. “So, we all thought that there would be some increase in permanent remote work, but we didn’t expect that to double from pre-pandemic levels.”<br/><br/>Moe Vela, Chief Transparency Officer of <a href='https://transparentbusiness.com/'><u>TransparentBusiness</u></a>, predicts that the need for large physical office spaces will gradually become a thing of the past. “Completely remote companies with no headquarters will continue to form as other organizations decide to reduce their office space for hybrid teams or forgo one altogether to save on costs,” adds Vela.<br/><br/>In an office setting, a positive attitude and strong relationships open the doors to advancement. One of the disadvantages of working remotely is that it's more difficult to highlight professional achievements. In 2021 employees will need to put extra effort into amplifying their engagement virtually to ensure they have access to new opportunities.<br/><br/>In a remote setting where employees collaborate mostly via email, engagement is much harder for workers to convey and for employers to identify. By participating in virtual events, being active in online meetings, and keeping enthusiasm high, employees will be able to stand out as leaders while working from home. <br/><br/><u><b>COURSES</b></u><br/><br/><b>FIVE FREE COURSES YOU CAN TAKE ON WORKSCHOOL TODAY</b><br/><br/>Wondering which course to take to elevate your tech career? Don’t worry we’ve got you covered. A lot of newbies struggle with the tech learning path, not knowing which course to take, not knowing which tech career path fits them most. <br/><a href='http://www.workschool.com'><u>WorkSchool</u></a> is here for you. We will help you aggregate the best course for your learning. In this article, you will see the top ten courses you can take on our website, these are interesting courses.<br/><br/><b>Our top five this week</b><br/><br/><b><li>How to Get Startup Ideas: <a href='https://www.workschool.co/course/how-to-get-startup-ideas-yc-63000/'>view the course</a></li></b><br/><li><b>Google Analytics for Beginners: <a href='https://www.workschool.co/course/google-analytics-for-beginners-google-1009/'>view the course</a></b></li><br/><li><b>Python Basics: <a href='https://www.workschool.co/course/python-basics-treehouse-62110/'>view the course<a></b></li><br/><li><b>Introduction to Data Structures: <a href='https://www.workschool.co/course/introduction-to-data-structures-treehouse-62090/'>view the course</a></b></li><br/><li><b>React Basics: <a href='https://www.workschool.co/course/react-basics-treehouse-62087/'>view the course</a></b></li><br/><br/><b>Why these courses:</b> Getting a technical skill and a soft skill is the best thing you can do for your career, at this point. These courses will introduce you to the tech world. There are endless possibilities in tech, and taking any of these courses will put you on the right path.<br/><br/><b>Duration:</b> You can complete the courses and earn your certificate within 2hours.<br/><br/><b>Big picture:</b> There is no sector in the world where technical skills are not needed. An average computer programmer makes over $50,000usd. You can be among the few people transforming their lives with tech. Transitioning to tech is made easy with WorkSchool. <br/><br/><u><b>FEATURE UPDATE</b></u><br/><br/><b>Fantastic New Feature on WorkSchool Website</b><br/><br/>WorkSchool has launched a newsletter to provide you with in-demand and informative news on jobs, education, careers weekly. Signup here to stay in the know. This is an incredible new feature on the WorkSchool website, be the first to get the latest gist from WorkSchool, don’t miss out, <a href='https://www.workschool.co/newsletter/'><u>sign up here.</u></a><br/></br><u><b>NEWS</b></u><br/><br/><b>Highlight from Apple’s June 2021 WWDC</b><br/><br/>On Monday Apple had its second event in 2021, it was filled with news, feature updates, and announcements. Apple surprised many people, there were no hardware updates.<br/><br/><b>Announcements - wait for it:</b><br/><br/><b>You can now share video and music over Facetime.</b> The new SharePlay feature is all about collaboration. It will let you watch or listen to content with others virtually. Users also have the opportunity to share their screens. Apple has also introduced a SharePlay API, this will help other developers to build apps that will support the feature.<br/><br/><b>You can now use the same mouse and keyboard across your Macs and your iPads.</b> Apple’s next big operating system is called Monterey. It is a big and exciting feature. It is surely going to be what users will love. Big ups to Apple.<br/><br/><b>Apple users can now access widgets on the homescreen, quick notes, and better multitasking.</b> With IPad becoming a replacement for laptops, Apple has introduced improvements, the ability to multitask, users can better customize their home-screen with widgets, access the app library, and a quick notes app that works everywhere.<br/><br/><u><b>JOB</b></u><br/><br/><b>Job Openings</b><br/><br/><b>Front End Engineer</b><br/><br/>Amazon · New York, NY <b><a href='https://www.amazon.jobs/en/jobs/1396044/front-end-engineer'><u>APPLY NOW</u></a></b><br/><br/><b>Backend Engineer - Consumer</b><br/><br/>Spotify · New York, NY <b><a href='https://jobs.lever.co/spotify/e354812b-3591-42b2-8e8d-4849777472db/apply'><u>APPLY NOW</u></a></b><br/><br/><b>Full-Stack Software Engineer II</b><br/><br/>Microsoft · New York, NY <b><a href='https://careers.microsoft.com/us/en/job/932937/Full-Stack-Software-Engineer?jobsource=linkedin&utm_source=linkedin&utm_medium=linkedin&utm_campaign=linkedin-feed'><u>APPLY NOW</u></a></b><br/><br/><b>Software Engineer (Leadership) - Infrastructure</b><br/><br/>Facebook · New York, NY <b><a href='https://careers.microsoft.com/us/en/job/932937/Full-Stack-Software-Engineer?jobsource=linkedin&utm_source=linkedin&utm_medium=linkedin&utm_campaign=linkedin-feed'><u>APPLY NOW</u></a></b><br/><br/><u><a href='https://www.workschool.co/jobs/'>See All Jobs</a></u><br/><br/><b>Employees Are Quitting Instead of Giving Up Working From Home</b><br/><br/>Workers are quitting their job instead of giving up working from home. One such worker is Portia Twidt, 33, who lives in Marietta, Georgia.<br/><br/>She’d taken the position as a research compliance specialist in February, enticed by promises of remote work. Then came the prodding to go into the office. Meeting invites piled up.<br/><br/>The final straw came a few weeks ago: the request for an in-person gathering, scheduled for all of 360 seconds. Twidt got dressed, dropped her two kids at daycare, drove to the office, had a brief chat, and decided she was done.<br/><br/>“I had just had it,” said Twidt.<br/><br/>While companies from Google to Ford Motor Co. and Citigroup Inc. have promised greater flexibility, many chief executives have publicly extolled the importance of being in offices. Some have lamented the perils of remote work, saying it diminishes collaboration and company culture. JPMorgan Chase & Co.’s Jamie Dimon said at a recent conference that it doesn’t work “for those who want to hustle.”<br/><br/>What do you think about remote work? <a href='https://www.workschool.co/newsletter/'><u>let us know</u></a><br/><br/><u><b>What's Happening</b></u><br/><br/><b>Attend TechCrunch Disrupt 2021</b><br/><br/>TechCrunch Disrupt is three days of non-stop online programming with two big focuses: founders and investors shaping the future of disruptive technology and ideas and startup experts providing insights to entrepreneurs. It's where hundreds of startups across a variety of categories tell their stories to 10,000+ influencers from all around the world. It's the ultimate Silicon Valley experience where the leaders of the startup world gather to ask questions, make connections and be inspired.<br/><br/>Get Your<a href=‘https://techcrunch.com/events/tc-disrupt-2021/?promo=homepagebar’> <u>Ticket</u></a><br/><br/><br/>-David Atilola contributed to this article.<br/><br/><br/><b>Get more from WorkSchool,<a href='http://www.workschool.co'> <u>visit WorkSchool.co</u></a></b><br/><br/><a href='https://www.workschool.co/newsletter/'><u>sign up here.</u></a> For more news. ",
            "link": "/knowledge-base-topic"
        },
        {
            "name": "REMOTE WORK",
            "img": "/content/img/photo/newsletter5.jpeg",
            "slug": "Remote-work",
            "subname": "To get the latest updates and news on career, jobs, workforce development, and education <a href='https://www.workschool.co/newsletter/'><u>subscribe to this newsletter by going here.</u></a>",
            "text": "“Believe you can and you’re halfway there.” — Theodore Roosevelt",
            "content": "<br/><br/><i>Quote of the Week<br/><br/>“Believe you can and you’re halfway there.” — Theodore Roosevelt</i><br/><br/><br/><b>Published on July 13, 2021</b><hr/><a href='https://www.linkedin.com/in/glen-patterson'><u>Glen Patterson</u></a><br/><br/><b>An educator, speaker, consultant, founder, investor, and squash and soccer enthusiast. Glen is the co-founder of the <a href='https://www.workschool.co/'><u>WorkSchool.</u></a></b><hr/><br/><br/><b>Iceland tested a 4-day workweek. Employees were productive — and happier, researchers say</b><br/><br/>Several large-scale trials of a four-day work week in <a href='https://en.wikipedia.org/wiki/Iceland'><u>Iceland</u></a> were an “overwhelming success,” with many workers shifting to shorter hours without affecting their productivity, and in some cases improving it.<br/><br/>A study conducted in June shows that 86% of Iceland’s working population were currently, or on the path to, working four-day workweeks with no reduction in pay.<br/><br/>The stat comes from a recent study that tracked 2,500 employees whose workweek was shortened to 35–36 hours over five years. Researchers found that a four-day week with the same pay improved workers’ well-being and productivity.<br/><br/>The trials were conducted between 2015 and 2019, initiated by the <a href='https://en.wikipedia.org/wiki/Reykjav%C3%ADk_City_Council'><u>Reykjavik City Council</u></a> and the Icelandic national government in response to demands from trade unions and civil society organizations for shorter workweeks.<br/><br/>“This study shows that the world’s largest ever trial of a shorter working week in the public sector was by all measures an overwhelming success,” Will Stronge, director of research at the <a href='https://autonomy.work/'><u>think tank Autonomy,</u></a> said in a statement to <a href='https://www.washingtonpost.com/'><u>The Washington Post,</u></a> adding that the program serves as a “landmark pilot” that provides a “precedent for other public authorities.”<br/><br/><b>Big picture:</b> The explosion of remote work during the pandemic has led to a rethinking of work-life balance, and more countries and even some companies in the <a href='https://en.wikipedia.org/wiki/United_States'><u>USA</u></a> are experimenting with a shorter workweek.<br/><br/><li><a href='https://buffer.com/'></u>Buffer,</u></a> a social media software company, has let its 89 employees work four days a week since May 2020. The crowdfunding platform <a href='https://www.kickstarter.com/'><u>Kickstarter</u></a> will test a four-day week for its 95 employees starting in 2022.</li><br/><li>Both Spain and Japan are piloting a 32-hour work week over three years in response to changing perceptions of work during Covid.</li><br/><b>Bottom line:</b> Experts said the “overwhelming success” of the trial in Iceland is a signal that a four-day workweek could gain traction far from the Arctic Circle.<br/><br/><u><b>COURSES</b></u><br/><br/><b>TOP 5 COURSES ON WORKSCHOOL THIS WEEK</b><br/><br/>Most people want to take courses to elevate their career, but they don't know where to start. Taking courses gives you the opportunity to improve yourself and change your condition. Are you looking for the best career learning path? We got you. <br/><a href='http://www.workschool.com'><u>WorkSchool</u></a>  is here to help you. In this article we have compiled the top five courses on our website this week.<br/><br/><b>Top 5 courses on WorkSchool:</b><br/><br/><b><li>Artificial Intelligence (AI) <a href='https://www.workschool.co/course/artificial-intelligence-ai-edx-17602/'><u>view the course</u></a></li></b><br/><li><b>Agile Process, Project, and Program Controls: <a href='https://www.workschool.co/course/agile-process-project-and-program-controls-edx-17018/'><u>view the course</u></a></b></li><br/><li><b>Introduction to Machine Learning: <a href='https://www.workschool.co/course/introduction-to-machine-learning-edx-17944/'><u>view the course</u><a></b></li><br/><li><b>Google Analytics for Beginners: <a href='https://www.workschool.co/course/google-analytics-for-beginners-google-1009/'><u>view the course</u></a></b></li><br/><li><b>Introduction to Watson AI: <a href='https://www.workschool.co/course/introduction-to-watson-ai-edx-17061/'><u>view the course</u></a></b></li><br/><br/><b>Why these courses:</b> Getting a technical skill and a soft skill is the best thing you can do for your career, at this point. These courses will introduce you to the tech world. There are endless possibilities in tech, and taking any of these courses will put you on the right path.<br/><br/><b>Duration:</b> You can complete the courses and earn your certificate within 2hours.<br/><br/><b>Big picture:</b> There is no sector in the world where technical skills are not needed. An average computer programmer makes over $50,000usd. You can be among the few people transforming their lives with tech. Transitioning to tech is made easy with WorkSchool.<br/><br/><u><b>NEWS</b></u><br/><b>What's Next for Jeff Bezos?</b><br/>Jeff Bezos is no longer the CEO of <a href='https://www.amazon.com/'><u>Amazon,</u></a> the company he founded as an online book retailer in Seattle in 1994.<br/><br/>The business took to new heights, slowly and steadily. Bezos expanded its business in the fields of e-commerce, artificial intelligence, cloud computing (now known as AWS), and digital streaming among many others.<br/><br/>A report by news agency <a href='https://www.afp.com/en/news-hub'><u>AFP</u></a> reveals that Amazon, which is often regarded as the most valuable brand on earth, now has a market value of over $1.7 trillion.<br/><br/>Here what's Bezos has decided to do after stepping down as CEO:<br/><br/><li><b>Day One Fund:</b> Bezos' philanthropic initiative created by Bill Gates and investor Warren Buffett to encourage the world’s wealthiest people to commit to giving at least half their wealth to charity.</li><br/><br/>In 2018, he himself donated $2 bn, in a bid to help homeless people and improve education for children in low-income families.<br/><br/><b>Bezos Earth Fund:</b> A $10 bn initiative to support scientists, and working to tackle the climate crisis.<br/><br/>“Climate change is the biggest threat to our planet. I want to work alongside others both to amplify known ways and to explore new ways of fighting the devastating impact of climate change on this planet we all share. This global initiative will fund scientists, activists, NGOs – any effort that offers a real possibility to help preserve and protect the natural world. We can save Earth. It’s going to take collective action from big companies, small companies, nation states, global organisations, and individuals. ⁣⁣Earth is the one thing we all have in common – let’s protect it, together”, Bezos said in a statement to Washington Post.<br/><br/><b>The Washington Post:</b> Bezos bought the Washington Post, a daily newspaper, in 2013 for $250m. After his appointment, reporters and editors had feared that the billionaire would interfere with editorial decision-making. However, now they say that the billionaire has never made any editorial decision but has only focused on the technology side of the business.<br/><br/><b>Blue Origin:</b> Bezos' space company, will be manufacturing space products at cheaper rates with reusable launch vehicles.<br/><br/>The company is also auctioning a seat for the 20 July flight, which will host an 11-minute trip to space that will reach an altitude of about 100 km.<br/><br/>The company plans to carry paying customers on a four-day space experience, including three days of pre-flight training at the company’s launch site near Van Horn, Texas.<br/><br/><u><b>JOB</b></u><br/><br/><b>Job Openings</b><br/><br/><b>Front End Engineer</b><br/><br/>Amazon · New York, NY <b><a href='https://www.amazon.jobs/en/jobs/1396044/front-end-engineer'><u>APPLY NOW</u></a></b><br/><br/><b>Backend Engineer - Consumer</b><br/><br/>Spotify · New York, NY <b><a href='https://jobs.lever.co/spotify/e354812b-3591-42b2-8e8d-4849777472db/apply'><u>APPLY NOW</u></a></b><br/><br/><b>Full-Stack Software Engineer II</b><br/><br/>Microsoft · New York, NY <b><a href='https://careers.microsoft.com/us/en/job/932937/Full-Stack-Software-Engineer?jobsource=linkedin&utm_source=linkedin&utm_medium=linkedin&utm_campaign=linkedin-feed'><u>APPLY NOW</u></a></b><br/><br/><b>Software Engineer (Leadership) - Infrastructure</b><br/><br/>Facebook · New York, NY <b><a href='https://careers.microsoft.com/us/en/job/932937/Full-Stack-Software-Engineer?jobsource=linkedin&utm_source=linkedin&utm_medium=linkedin&utm_campaign=linkedin-feed'><u>APPLY NOW</u></a></b><br/><br/><u><a href='https://www.workschool.co/jobs/'>See All Jobs</a></u><br/><br/><br/><b><u>OPPORTUNITY</u></b><br/><br/><b>Rhodes Global Scholarships 2021 for Postgraduate Study at University of Oxford (Fully Funded)</b><br/><br/>Applications for Rhodes Scholarship are currently open. Rhodes Scholarship 2022 is a fully funded scholarship for international students. This scholarship provides a living stipend (£15,144 per annum), all University and College fees and the University application fee.<br/><br/>The Rhodes Scholarship is offered to international students who intend to undertake postgraduate studies at University of Oxford UK for academic year 2021-2022. Rhodes Scholarship provides the recipient with a living stipend (£15,144 per annum), all University and College fees and the University application fee. A class of 100 Scholars is selected each year from over 60 countries around the world.<br/><br/><a href='https://www.rhodeshouse.ox.ac.uk/scholarships/apply/'><u>Click here to apply.</u></a><br/><br/><b>Top 10 Freelance Sites to Find Work</b><br/><br/><li><a href='https://www.fiverr.com/'><u>Fiverr</u></a></li><li><a href='https://www.upwork.com/'><u>Upwork</u></a></li><li><a href='https://www.toptal.com/'><u>Toptal</u></a></li><li><a href='https://www.simplyhired.com/'><u>Simply Hired</u></a></li><li><a href='https://www.peopleperhour.com/'><u>PeoplePerHour</u></a></li><li><a href='https://www.freelancer.com/job-search/crowded-freelance/'><u>Crowded</u></a></li><li><a href='https://www.roberthalf.com/employers/creativegroup'><u>The Creative Group</u></a></li><li><a href='https://www.freelancer.com/'><u>Freelancer</u></a></li><li><a href='https://www.taskrabbit.com/'><u>TaskRabbit</u></a></li><li><a href='https://www.guru.com/'><u>Guru</u></a></li><br/><br/><a href='https://www.workschool.co/jobs/'><u>See all Jobs</u><a><br/><br/><br/><b>Get more from WorkSchool,<a href='http://www.workschool.co'> <u>visit WorkSchool.co</u></a></b> ",
            "link": "/knowledge-base-topic"
        },
        {
            "name": "EDUCATION AND SPORT",
            "img": "/content/img/photo/newsletter3.jpeg",
            "slug": "Education-and-Sport",
            "subname": "To get the latest updates and news on career, jobs, workforce development, and education <a href='https://www.workschool.co/newsletter/'><u>subscribe to this newsletter by going here.</u></a>",
            "text": "“I’m a great believer in luck, and I find the harder I work, the more I have of it.” – Thomas Jefferson.",
            "content": "<br/><br/><i>Quote of the Week<br/><br/>“I’m a great believer in luck, and I find the harder I work, the more I have of it.” – Thomas Jefferson.</i> <br/><br/><br/><b>Published on July 13, 2021</b><hr/><a href='https://www.linkedin.com/in/glen-patterson'><u>Glen Patterson</u></a><br/><br/><b>An educator, speaker, consultant, founder, investor, and squash and soccer enthusiast. Glen is the co-founder of the <a href='https://www.workschool.co/'><u>WorkSchool.</u></a></b><hr/><br/><b>SUPREME COURT WIN FOR COLLEGE ATHLETES IN COMPENSATION CASE</b><br/><br/>College athletes scored another big W in their looooong quest to get paid for their work on the field.<br/><br/>Yesterday, the US Supreme Court ruled unanimously that the NCAA cannot stop colleges from compensating student athletes, as long as that compensation is tied to education.<br/><br/>So you won't see your favorite running back receiving a salary (yet). But athletes can now receive monetary benefits like tutoring, study abroad, academic awards, and more.<br/><br/><b>What you should know:</b> Justice Neil Gorsuch explained that the NCAA, the 115-year-old organization that governs college athletics, is not exempt from antitrust laws put in place to promote fair competition. But it was Justice Kavanaugh who really skewered the NCAA with the passion of an aggrieved LSU baseball fan.<br/><br/>“The bottom line is that the NCAA and its member colleges are suppressing the pay of student athletes who collectively generate billions of dollars in revenues for colleges every year.”<br/><br/>“But the student athletes who generate the revenues, many of whom are African American and from lower-income backgrounds, end up with little or nothing.”<br/><br/><b>Interesting fact:</b> College coaches were the highest-paid public employee in 40 states in 2019.<br/><br/>For its part, the NCAA claims that compensating student athletes would undermine the “amateur” flavor of college sports, damaging fans' enjoyment of the product.<br/><br/><b>Nature is Healing and Employees Are WeWorking</b><br/>WeWork is making the most of its second chance. From April to May, the company sold more desks than it had cancellations, making it WeWork's best stretch for sales since September 2019, Bloomberg reported.<br/><br/>Although its occupancy rate has improved to 53%, that's still well below its former peak of ~70%.<br/><br/><b>Some credit to WeWork:</b> The company shelved its IPO plans in 2019. And it went from most anticipated stock to laughing stock. But then WeWork implemented tough-but-necessary changes under the supervision of major investor SoftBank. It parted ways with CEO Adam Neumann and dramatically cut expenses, including through thousands of layoffs.<br/><br/>While the pandemic was initially a gut punch, it also offered the company a shot at reinvention. More offices are looking for hybrid or remote-friendly setups, and WeWork is once again poised to scratch the labor market's newest itch. The company is already offering more flexible memberships with on-demand booking and access to multiple locations.<br/><br/><b>What to expect:</b> WeWork is tracking for $1.9 billion in revenue and aims to go public this year exactly how you'd expect: a $9 billion SPAC deal with BowX Acquisition Corp.<br/>{Source: morning brew}<br/><br/><u><b>COURSES</b></u><br/><br/><b>FIVE FREE COURSES YOU CAN TAKE ON WORKSCHOOL TODAY</b><br/><br/>Wondering which course to take to elevate your tech career? Don’t worry we’ve got you covered. A lot of newbies struggle with the tech learning path, not knowing which course to take, not knowing which tech career path fits them most. <br/><a href='http://www.workschool.com'><u>WorkSchool</u></a> is here for you. We will help you aggregate the best course for your learning. In this article, you will see the top ten courses you can take on our website, these are interesting courses.<br/><br/><b>Our top five this week</b><br/><br/><b><li>Blockchain and FinTech: Basics, Applications, and Limitations: <a href='https://www.workschool.co/course/blockchain-and-fintech-basics-applications-and-limitations-edx-17685/'><u>view the course</u></a></li></b><br/><li><b>Google Analytics for Beginners: <a href='https://www.workschool.co/course/google-analytics-for-beginners-google-1009/'><u>view the course</u></a></b></li><br/><li><b>CS50's Web Programming with Python and JavaScript: <a href='https://www.workschool.co/course/cs50's-web-programming-with-python-and-javascript-edx-18898/'><u>view the course</u><a></b></li><br/><li><b>Introduction to Data Structures: <a href='https://www.workschool.co/course/introduction-to-data-structures-treehouse-62090/'><u>view the course</u></a></b></li><br/><li><b>Writing Masterclass: Words (Strategy 1 in the Writing Masterclass Series): <a href='https://www.workschool.co/course/writing-masterclass-words-(strategy-1-in-the-writing-masterclass-series)-skillshare-31370/'><u>view the course</u></a></b></li><br/><br/><b>Why these courses:</b> Getting a technical skill and a soft skill is the best thing you can do for your career, at this point. These courses will introduce you to the tech world. There are endless possibilities in tech, and taking any of these courses will put you on the right path.<br/><br/><b>Duration:</b> You can complete the courses and earn your certificate within 2hours.<br/><br/><b>Big picture:</b> There is no sector in the world where technical skills are not needed. An average computer programmer makes over $50,000usd. You can be among the few people transforming their lives with tech. Transitioning to tech is made easy with WorkSchool.<br/><br/><b><u>WorkSchool Thoughts</u></b><br/><br/><b>How to Build a Positive Organizational Work Culture</b><br/><br/>Many companies boast about having cut-throat, high pressure, take no-prisoners culture to drive profit and success.<br/><br/>A high level research on positive organisational work culture has shown that not only is a cut-throat environment harmful to productivity over time, but that a positive environment will lead to dramatic benefits for employers, employees, and the bottom line.<br/><br/>Although the assumption is that stress and pressure push employees to perform more, better, and faster, what we fail to understand is the hidden cost incurred.<br/><br/><b>Stress</b><br/>Health care expenditures at high-pressure companies are nearly 50% greater than at other organizations. The American Psychological Association estimates that more than $500 billion is siphoned off from the U.S. economy because of workplace stress, and 550 million workdays are lost each year due to stress on the job. Sixty percent to 80% of workplace accidents are attributed to stress, and it’s estimated that more than 80% of doctor visits are due to stress. Workplace stress has been linked to health problems ranging from metabolic syndrome to cardiovascular disease and mortality.<br/><br/><b>Loyalty</b><br/>The third cost is a lack of loyalty. Research shows that workplace stress leads to an increase of almost 50% in voluntary turnover. People go on the job market, decline promotions, or resign. And the turnover costs associated with recruiting, training, lowered productivity, lost expertise, and so forth, are significant. The Center for American Progress estimates that replacing a single employee costs approximately 20% of that employee’s salary.<br/><br/><br/><b><u>JOBS</u></b><br/><br/><b>Job Openings</b><br/><br/><b>Front End Engineer</b><br/><br/>Amazon · New York, NY <b><a href='https://www.amazon.jobs/en/jobs/1396044/front-end-engineer'><u>APPLY NOW</u></a></b><br/><br/><b>Backend Engineer - Consumer</b><br/><br/>Spotify · New York, NY <b><a href='https://jobs.lever.co/spotify/e354812b-3591-42b2-8e8d-4849777472db/apply'><u>APPLY NOW</u></a></b><br/><br/><b>Full-Stack Software Engineer II</b><br/><br/>Microsoft · New York, NY <b><a href='https://careers.microsoft.com/us/en/job/932937/Full-Stack-Software-Engineer?jobsource=linkedin&utm_source=linkedin&utm_medium=linkedin&utm_campaign=linkedin-feed'><u>APPLY NOW</u></a></b><br/><br/><b>Software Engineer (Leadership) - Infrastructure</b><br/><br/>Facebook · New York, NY <b><a href='https://careers.microsoft.com/us/en/job/932937/Full-Stack-Software-Engineer?jobsource=linkedin&utm_source=linkedin&utm_medium=linkedin&utm_campaign=linkedin-feed'><u>APPLY NOW</u></a></b><br/><br/><u><a href='https://www.workschool.co/jobs/'>See All Jobs</a></u><br/><br/><b><u>What’s happening</u></b><br/><br/><b>Rhodes Global Scholarships 2021 for Postgraduate Study at University of Oxford (Fully Funded)</b><br/><br/>Applications for Rhodes Scholarship are currently open. Rhodes Scholarship 2022 is a fully funded scholarship for international students. This scholarship provides a living stipend (£15,144 per annum), all University and College fees and the University application fee.<br/><br/>The Rhodes Scholarship is offered to international students who intend to undertake postgraduate studies at University of Oxford UK for academic year 2021-2022. Rhodes Scholarship provides the recipient with a living stipend (£15,144 per annum), all University and College fees and the University application fee. A class of 100 Scholars is selected each year from over 60 countries around the world.<br/><br/><a href='https://www.rhodeshouse.ox.ac.uk/scholarships/apply/'><u>Click here to apply.</u></a><br/><br/>WorkSchool is proud to offer you this weekly email newsletter. To make sure this newsletter is hitting your email, please take the following steps:<br/><br/><li>Move us to your primary inbox if you use gmail.</li><br/><li>Add us to your VIP list if you use Apple Mail</li><br/><li>Add us to your favorites if you use Outlook</li><br/><li>Or some combination of the above if you use anything else</li><br/><br/>WorkSchool is proud to offer you this biweekly email newsletter. To make sure this newsletter is hitting your email, please take the following steps:<br/><br/>Move us to your primary inbox if you use g-mail. Add us to your VIP list if you use Apple Mail<br/><br/>Add us to your favorites if you use Outlook Or some combination of the above if you use anything else.<br/><br/><br/>-David Atilola contributed to this article.<br/><br/><br/><b>Get more from WorkSchool, <a href='http://www.workschool.co'><u>visit WorkSchool.co</u></a></b><br/><br/><a href='https://www.workschool.co/newsletter/'><u>sign up here.</u></a></b> For more news ",
            "link": "/knowledge-base-topic"
        }
    ]
}